TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_fsk.c
/**
  ******************************************************************************
  * @file  stm32wlxx_app_radio_fsk.c
  * @brief FSK-specific portion of the radio driver for the STM32WLxx Radio App
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <assert.h>
#include <string.h>

#include "stm32wlxx_phy.h"
#include "stm32wlxx_app_radio.h"
#include "stm32wlxx_app_radio_hal.h"

#include <sid_pal_assert_ifc.h>
#include <sid_pal_log_ifc.h>
#include <sid_pal_radio_fsk_defs.h>

#include <sid_stm32_common_utils.h>

/* Private defines -----------------------------------------------------------*/

#define  STM32WLxx_FSK_RX_PROCESS_SAFETY_GAP_US (50u)   /*!< Rx window will be opened earlier by this amount of microseconds to mitigate any SW execution delays and jitter */

#define STM32WLxx_SIDEWALK_FSK_CS_DURATION_US   (1200u) /*!< Carrier Sense timeout for FSK link as defined by Sidewalk specification */

#define WL55_FSK_MAX_PAYLOAD_LENGTH             (255u)
#define WL55_FSK_SYNC_WORD_LENGTH_IN_RX         (3u)
#define MAX_PAYLOAD_LENGTH_WITH_FCS_TYPE_0      (251u)
#define MAX_PAYLOAD_LENGTH_WITH_FCS_TYPE_1      (253u)

#define STM32WLxx_FSK_POLYNOMIAL_CRC16          (0x1021u)
#define STM32WLxx_FSK_POLYNOMIAL_CRC32          (0x04C11DB7u)

#define RADIO_FSK_BR_50KBPS                     (50000u)
#define RADIO_FSK_BR_150KBPS                    (150000u)
#define RADIO_FSK_BR_250KBPS                    (250000u)

#define RADIO_FSK_FDEV_19KHZ                    (19000u)
#define RADIO_FSK_FDEV_25KHZ                    (25000u)
#define RADIO_FSK_FDEV_37_5KHZ                  (37500u)
#define RADIO_FSK_FDEV_62_5KHZ                  (62500u)

/* Private macros ------------------------------------------------------------*/

#ifndef STM32WLxx_RADIO_FSK_EXTRA_LOGGING
/* Set STM32WLxx_RADIO_FSK_EXTRA_LOGGING to 1 to enable extended logs */
#  define STM32WLxx_RADIO_FSK_EXTRA_LOGGING (0)
#endif

#if STM32WLxx_RADIO_FSK_EXTRA_LOGGING
#  define STM32WLxx_FSK_LOG_ERROR(...)   SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define STM32WLxx_FSK_LOG_WARNING(...) SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define STM32WLxx_FSK_LOG_INFO(...)    SID_PAL_LOG_INFO(__VA_ARGS__)
#  define STM32WLxx_FSK_LOG_DEBUG(...)   SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define STM32WLxx_FSK_LOG_TRACE(...)   SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define STM32WLxx_FSK_LOG_ERROR(...)   ((void)0u)
#  define STM32WLxx_FSK_LOG_WARNING(...) ((void)0u)
#  define STM32WLxx_FSK_LOG_INFO(...)    ((void)0u)
#  define STM32WLxx_FSK_LOG_DEBUG(...)   ((void)0u)
#  define STM32WLxx_FSK_LOG_TRACE(...)   ((void)0u)
#endif

/* Private constants ---------------------------------------------------------*/

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
const sid_pal_radio_fsk_phy_settings_t fsk_phy_default_cfg = {
    .sync_word                     = {0x55u, 0x6Fu, 0x4Eu},
    .sync_word_len                 = WL55_FSK_SYNC_WORD_LENGTH_IN_RX,
    .whitening_seed                = SID_PAL_RADIO_FSK_WHITENING_SEED,
    .fsk_modulation_params = {
        .bit_rate                  = RADIO_FSK_BR_50KBPS,
        .freq_dev                  = RADIO_FSK_FDEV_25KHZ,
        .mod_shaping               = SID_PAL_RADIO_FSK_MOD_SHAPING_G_BT_1,
        .bandwidth                 = SID_PAL_RADIO_FSK_BW_150KHZ,
    },
    .fsk_cad_params = {
        .fsk_cs_min_prm_det        = SID_PAL_RADIO_FSK_PREAMBLE_DETECTOR_16_BITS,
        .fsk_cs_duration_us        = STM32WLxx_SIDEWALK_FSK_CS_DURATION_US,
    },
};
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

/* Private function prototypes -----------------------------------------------*/

static inline void     _perform_data_whitening(uint16_t seed, const uint8_t * const buffer_in, uint8_t * const buffer_out, const uint16_t length);
static inline uint16_t _compute_crc16(const uint8_t * const buffer, const uint32_t length);
static inline uint32_t _compute_crc32(const uint8_t * const buffer, const uint32_t length);
static inline void     radio_modparams_to_stm32wlxx_modparams(stm32wlxx_radio_fsk_phy_mod_params_t * const fsk_mp, const sid_pal_radio_fsk_modulation_params_t * const mod_params);
static inline void     radio_pktparams_to_stm32wlxx_pktparams(stm32wlxx_pkt_params_gfsk_t *fsk_pp, const sid_pal_radio_fsk_packet_params_t *packet_params);

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _perform_data_whitening(uint16_t seed, const uint8_t * const buffer_in, uint8_t * const buffer_out, const uint16_t length)
{
    uint16_t lfsr    = seed;
    uint16_t xor_out = 0u;
    uint8_t  ret     = 0u;
    uint8_t  result  = 0u;

    for (uint32_t index = 0u; index < length; index++)
    {
        xor_out = 0;
        ret     = 0;
        result  = 0;

        xor_out = ( ( lfsr >> 5 ) & 0x0Fu ) ^ ( lfsr & 0x0Fu );
        lfsr    = (   lfsr >> 4 ) | ( xor_out << 5 );
        ret    |= (   lfsr >> 5 ) & 0x0Fu;

        xor_out = ( ( lfsr >> 5 ) & 0x0Fu ) ^ ( lfsr & 0x0Fu );
        lfsr    = (   lfsr >> 4 ) | ( xor_out << 5 );
        ret    |= ( ( lfsr >> 1 ) & 0xF0u );

        result |= ( ret & 0x80u ) >> 7;
        result |= ( ret & 0x40u ) >> 5;
        result |= ( ret & 0x20u ) >> 3;
        result |= ( ret & 0x10u ) >> 1;
        result |= ( ret & 0x08u ) << 1;
        result |= ( ret & 0x04u ) << 3;
        result |= ( ret & 0x02u ) << 5;
        result |= ( ret & 0x01u ) << 7;

        buffer_out[index] = buffer_in[index] ^ result;
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint16_t _compute_crc16(const uint8_t * const buffer, const uint32_t length)
{
    if ((NULL == buffer) || (0u == length))
    {
        return 0u;
    }

    register uint16_t crc16 = 0x0000u;

    for (uint32_t index_buffer = 0u; index_buffer < length; index_buffer++)
    {
        crc16 ^= ( ( uint16_t ) buffer[index_buffer] << 8 );

