TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_fsk.c
        for (uint32_t i = 0u; i < 8u; i++ )
        {
            crc16 = (uint16_t)(( crc16 & 0x8000u ) ? ( crc16 << 1 ) ^ STM32WLxx_FSK_POLYNOMIAL_CRC16 : ( crc16 << 1 ));
        }
    }

    return crc16;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint32_t _compute_crc32(const uint8_t * const buffer, const uint32_t length)
{
    if ((NULL == buffer) || (0u == length))
    {
        return 0u;
    }

    uint8_t           temp_buffer[sizeof(uint32_t)] = {0};
    register uint32_t crc32                         = 0xFFFFFFFFu;
    const uint8_t *   buffer_local;
    uint32_t          length_local;

    if (length < sizeof(uint32_t))
    {
        SID_STM32_UTIL_fast_memcpy(temp_buffer, buffer, length);
        length_local = sizeof(uint32_t);
        buffer_local = temp_buffer;
    }
    else
    {
        length_local = length;
        buffer_local = buffer;
    }

    for (uint32_t index_buffer = 0u; index_buffer < length_local; index_buffer++)
    {
        crc32 ^= ( index_buffer < length ) ? ( ( uint32_t ) buffer_local[index_buffer] << 24 ) : 0x00000000u;

        for (uint32_t i = 0u; i < 8u; i++ )
        {
            crc32 = ( crc32 & 0x80000000u ) ? ( crc32 << 1 ) ^ STM32WLxx_FSK_POLYNOMIAL_CRC32 : ( crc32 << 1 );
        }
    }

    return ~crc32;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void radio_modparams_to_stm32wlxx_modparams(stm32wlxx_radio_fsk_phy_mod_params_t * const fsk_mp, const sid_pal_radio_fsk_modulation_params_t * const mod_params)
{
    fsk_mp->bandwidth = (stm32wlxx_gfsk_bw_t)mod_params->bandwidth;
    fsk_mp->bit_rate  = mod_params->bit_rate;
    fsk_mp->freq_dev  = mod_params->freq_dev;
    fsk_mp->shaping   = (stm32wlxx_gfsk_mod_shapes_t)mod_params->mod_shaping;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void radio_pktparams_to_stm32wlxx_pktparams(stm32wlxx_pkt_params_gfsk_t *fsk_pp, const sid_pal_radio_fsk_packet_params_t *packet_params)
{
    if(packet_params->preamble_length > 1u)
    {
        fsk_pp->pbl_len_in_bits       = (uint16_t)((packet_params->preamble_length - 1u) << 3);
    }
    else
    {
        fsk_pp->pbl_len_in_bits       = 0u;
    }
    fsk_pp->pbl_min_det           = (stm32wlxx_gfsk_pbl_det_t)packet_params->preamble_min_detect;
    fsk_pp->sync_word_len_in_bits = (uint8_t)(packet_params->sync_word_length << 3);
    fsk_pp->addr_cmp              = (stm32wlxx_gfsk_addr_cmp_t)packet_params->addr_comp;
    fsk_pp->hdr_type              = (stm32wlxx_gfsk_pkt_len_modes_t)packet_params->header_type;
    fsk_pp->pld_len_in_bytes      = packet_params->payload_length;
    fsk_pp->crc_type              = (stm32wlxx_gfsk_crc_types_t)packet_params->crc_type;
    fsk_pp->dc_free               = (stm32wlxx_gfsk_dc_free_t)packet_params->radio_whitening_mode;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_pal_radio_data_rate_t sid_pal_radio_fsk_mod_params_to_data_rate(const sid_pal_radio_fsk_modulation_params_t * mp)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    sid_pal_radio_data_rate_t data_rate;

    if (       (RADIO_FSK_BR_50KBPS  == mp->bit_rate) && (RADIO_FSK_FDEV_25KHZ  == mp->freq_dev) && ((uint8_t)SID_PAL_RADIO_FSK_BW_125KHZ == mp->bandwidth))
    {
        data_rate =  SID_PAL_RADIO_DATA_RATE_50KBPS;
    } else if ((RADIO_FSK_BR_150KBPS == mp->bit_rate) && (RADIO_FSK_FDEV_37_5KHZ == mp->freq_dev) && ((uint8_t)SID_PAL_RADIO_FSK_BW_250KHZ == mp->bandwidth))
    {
        data_rate = SID_PAL_RADIO_DATA_RATE_150KBPS;
    } else if ((RADIO_FSK_BR_250KBPS == mp->bit_rate) && (RADIO_FSK_FDEV_62_5KHZ == mp->freq_dev) && ((uint8_t)SID_PAL_RADIO_FSK_BW_500KHZ == mp->bandwidth))
    {
        data_rate = SID_PAL_RADIO_DATA_RATE_250KBPS;
    }
    else
    {
        data_rate = SID_PAL_RADIO_DATA_RATE_INVALID;
    }

    return data_rate;
#else
    (void)mp;

    return SID_PAL_RADIO_DATA_RATE_INVALID;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_fsk_data_rate_to_mod_params(sid_pal_radio_fsk_modulation_params_t *mod_params, sid_pal_radio_data_rate_t data_rate)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    if (NULL == mod_params)
    {
       return RADIO_ERROR_INVALID_PARAMS;
    }

    switch (data_rate)
    {
        case SID_PAL_RADIO_DATA_RATE_50KBPS:
            mod_params->bit_rate     = RADIO_FSK_BR_50KBPS;
            mod_params->freq_dev     = RADIO_FSK_FDEV_25KHZ;
            mod_params->bandwidth    = (uint8_t)SID_PAL_RADIO_FSK_BW_125KHZ;
            mod_params->mod_shaping  = (uint8_t)STM32WLxx_GFSK_MOD_SHAPE_BT_1;
            break;

        case SID_PAL_RADIO_DATA_RATE_150KBPS:
            mod_params->bit_rate     = RADIO_FSK_BR_150KBPS;
            mod_params->freq_dev     = RADIO_FSK_FDEV_37_5KHZ;
            mod_params->bandwidth    = (uint8_t)SID_PAL_RADIO_FSK_BW_250KHZ;
            mod_params->mod_shaping  = (uint8_t)STM32WLxx_GFSK_MOD_SHAPE_BT_05;
            break;

        case SID_PAL_RADIO_DATA_RATE_250KBPS:
            mod_params->bit_rate     = RADIO_FSK_BR_250KBPS;
            mod_params->freq_dev     = RADIO_FSK_FDEV_62_5KHZ;
            mod_params->bandwidth    = (uint8_t)SID_PAL_RADIO_FSK_BW_500KHZ;
            mod_params->mod_shaping  = (uint8_t)STM32WLxx_GFSK_MOD_SHAPE_BT_05;
            break;

        default:
            return RADIO_ERROR_INVALID_PARAMS;
    }

    return RADIO_ERROR_NONE;
#else
    (void)mod_params;
    (void)data_rate;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_prepare_fsk_for_rx(sid_pal_radio_fsk_pkt_cfg_t * rx_pkt_cfg)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    int32_t err = RADIO_ERROR_INVALID_PARAMS;

    do
    {
        if (NULL == rx_pkt_cfg)
        {
            break;
        }

        if ((NULL == rx_pkt_cfg->phy_hdr) || (NULL == rx_pkt_cfg->packet_params) || (NULL == rx_pkt_cfg->sync_word))
        {
            break;
        }

        sid_pal_radio_fsk_packet_params_t *f_pp  =  rx_pkt_cfg->packet_params;
        sid_pal_radio_fsk_phy_hdr_t       *phr   =  rx_pkt_cfg->phy_hdr;
        uint8_t                           *sw    =  rx_pkt_cfg->sync_word;

        f_pp->preamble_min_detect       = (uint8_t)STM32WLxx_GFSK_PBL_DET_16_BITS;
        f_pp->sync_word_length          = WL55_FSK_SYNC_WORD_LENGTH_IN_RX;
        f_pp->addr_comp                 = (uint8_t)STM32WLxx_GFSK_ADDR_CMP_FILT_OFF;
        f_pp->header_type               = (uint8_t)STM32WLxx_GFSK_PKT_FIX_LEN;
        f_pp->payload_length            = WL55_FSK_MAX_PAYLOAD_LENGTH;
        f_pp->crc_type                  = (uint8_t)STM32WLxx_GFSK_CRC_OFF;
        f_pp->radio_whitening_mode      = (uint8_t)STMWLxx_GFSK_DC_FREE_OFF;

        /* The sync word length must be greater than preamble min detect.
         * As preamble min detect is 2 bytes set sync word length to 3 bytes.
         */
        sw[0]                           = 0x55u;
        sw[1]                           = phr->is_fec_enabled ? 0x6Fu : 0x90u;
        sw[2]                           = 0x4Eu;

        err = RADIO_ERROR_NONE;
    } while(0);

