TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_fsk.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_fsk_modulation_params(const sid_pal_radio_fsk_modulation_params_t * mod_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    int32_t                                       err               = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t                        hal_err;
    const halo_drv_stm32wlxx_ctx_t * const        drv_ctx           = stm32wlxx_radio_get_drv_ctx_ctx();
    sid_pal_radio_fsk_modulation_params_t * const active_mod_params = (sid_pal_radio_fsk_modulation_params_t *)&drv_ctx->applied_fsk_phy_cfg.fsk_modulation_params;

    do
    {
        /* Note: always send out modulation parameters even if there are no changes to keep Rx/Tx setup timings consistent */
        stm32wlxx_radio_fsk_phy_mod_params_t hal_mod_params = {
            .bit_rate  = mod_params->bit_rate,
            .freq_dev  = mod_params->freq_dev,
            .shaping   = mod_params->mod_shaping,
        };

        _Static_assert(STM32WLxx_GFSK_BW_4800   == SID_PAL_RADIO_FSK_BW_4800   , "Invalid conversion");
        /* STM32WLxx_GFSK_BW_5800   != SID_PAL_RADIO_FSK_BW_5800 */
        _Static_assert(STM32WLxx_GFSK_BW_7300   == SID_PAL_RADIO_FSK_BW_7300   , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_9700   == SID_PAL_RADIO_FSK_BW_9700   , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_11700  == SID_PAL_RADIO_FSK_BW_11700  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_14600  == SID_PAL_RADIO_FSK_BW_14600  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_19500  == SID_PAL_RADIO_FSK_BW_19500  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_23400  == SID_PAL_RADIO_FSK_BW_23400  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_29300  == SID_PAL_RADIO_FSK_BW_29300  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_39000  == SID_PAL_RADIO_FSK_BW_39000  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_46900  == SID_PAL_RADIO_FSK_BW_46900  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_58600  == SID_PAL_RADIO_FSK_BW_58600  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_78200  == SID_PAL_RADIO_FSK_BW_78200  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_93800  == SID_PAL_RADIO_FSK_BW_93800  , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_117300 == SID_PAL_RADIO_FSK_BW_117300 , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_156200 == SID_PAL_RADIO_FSK_BW_156200 , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_187200 == SID_PAL_RADIO_FSK_BW_187200 , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_234300 == SID_PAL_RADIO_FSK_BW_234300 , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_312000 == SID_PAL_RADIO_FSK_BW_312000 , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_373600 == SID_PAL_RADIO_FSK_BW_373600 , "Invalid conversion");
        _Static_assert(STM32WLxx_GFSK_BW_467000 == SID_PAL_RADIO_FSK_BW_467000 , "Invalid conversion");

        switch (mod_params->bandwidth)
        {
            case SID_PAL_RADIO_FSK_BW_5800:
                hal_mod_params.bandwidth = STM32WLxx_GFSK_BW_5800;
                break;

            case SID_PAL_RADIO_FSK_BW_125KHZ:
                hal_mod_params.bandwidth = STM32WLxx_GFSK_BW_117300;
                break;

            case SID_PAL_RADIO_FSK_BW_250KHZ:
                hal_mod_params.bandwidth = STM32WLxx_GFSK_BW_234300;
                break;

            case SID_PAL_RADIO_FSK_BW_500KHZ:
                hal_mod_params.bandwidth = STM32WLxx_GFSK_BW_467000;
                break;

            default:
                hal_mod_params.bandwidth = mod_params->bandwidth;
                break;
        }

        hal_err = stm32wlxx_hal_set_fsk_modulation_params(drv_ctx, &hal_mod_params);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy((void *)active_mod_params, mod_params, sizeof(*active_mod_params));
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply FSK modulation params. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)mod_params;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_fsk_packet_params(const sid_pal_radio_fsk_packet_params_t * packet_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    int32_t                                   err               = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t                    hal_err;
    const halo_drv_stm32wlxx_ctx_t * const    drv_ctx           = stm32wlxx_radio_get_drv_ctx_ctx();
    sid_pal_radio_fsk_packet_params_t * const active_pkt_params = (sid_pal_radio_fsk_packet_params_t *)&drv_ctx->applied_fsk_phy_cfg.fsk_packet_params;

    do
    {
        /* Note: always send out packet parameters even if there are no changes to keep Rx/Tx setup timings consistent */
        stm32wlxx_pal_radio_fsk_pkt_params_t hal_pkt_params = {
            .preamble_length      = packet_params->preamble_length,
            .preamble_min_detect  = packet_params->preamble_min_detect,
            .sync_word_length     = packet_params->sync_word_length,
            .addr_comp            = packet_params->addr_comp,
            .header_type          = packet_params->header_type,
            .payload_length       = packet_params->payload_length,
            .crc_type             = packet_params->crc_type,
            .radio_whitening_mode = packet_params->radio_whitening_mode,
        };

        hal_err = stm32wlxx_hal_radio_set_fsk_pkt_params(drv_ctx, hal_pkt_params);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy((void *)active_pkt_params, packet_params, sizeof(*active_pkt_params));
        err = RADIO_ERROR_NONE;
    } while (0);

